/* Цей файл містить функцію, що відповідає за доступ до засекречених змінних програми через donrev */

import dotenv from "dotenv"; // Бібліотека для засекречення змінних середовища
dotenv.config(); // потрібно викликати на самому початку програми (перед використанням змінних середовища).

export function getEnvVar(name, defaultValue) { // Функція яка приймає два аргументи ім"я та дефолтне значення
    const value = process.env[name]; // Сюди записуємо значення переданої змінної

    if (value) return value; // Повертаємо значення записаної змінної

    if (defaultValue) return defaultValue; // Повертаємо дефолтне значення

    throw new Error(`Missing: process.env['${name}']`); // Якщо перші 2 умови не спрацювали, повертаємо помилку
}